
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

32-user 64-core Stata network perpetual license:
       Serial number:  501506200495
         Licensed to:  Harvard-MIT Data Center
                       Cambridge, MA

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "dofiles/3_estimates_figure4.do" 

. /****************************************************************************
> *****************************
> Replication Files for Housing Discrimination and the Toxics Exposure Gap in t
> he United States: 
> Evidence from the Rental Market  by Peter Christensen, Ignacio Sarmiento-Barb
> ieri and Christopher Timmins
> *****************************************************************************
> ****************************/
. 
. 
. clear all

. set matsize 11000

. 
. use "../stores/toxic_discrimination_data.dta"

. 
. 
. keep if sample==1
(801 observations deleted)

. 
. loc quartiles 4

. 
. set seed 1010101

. 
. *****************************************************************************
> *******************
. * Minority
. *****************************************************************************
> *******************
. * Within 1 more than 1
. *****************************************************************************
> *******************
. 
. 
. disc_boot choice  Minority_within1  Minority_more1 , varlist(i.gender i.educa
> tion_level i.order)
note: multiple positive outcomes within groups encountered.
note: 1,331 groups (4,026 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood = -936.69707  
Iteration 1:   log pseudolikelihood = -928.68062  
Iteration 2:   log pseudolikelihood = -928.66086  
Iteration 3:   log pseudolikelihood = -928.66086  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      2,755
                                                Wald chi2(7)      =      86.67
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -928.66086               Pseudo R2         =     0.0806

                              (Std. Err. adjusted for 14 clusters in Zip_Code)
------------------------------------------------------------------------------
             |               Robust
      choice |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
Minority_w~1 |  -.1187963    .139312    -0.85   0.394    -.3479442    .1103517
Minority_m~1 |  -.4281179   .1133544    -3.78   0.000    -.6145694   -.2416665
             |
      gender |
       male  |  -.3329491   .0899387    -3.70   0.000    -.4808851   -.1850131
             |
education_~l |
        low  |  -.1746532   .1198402    -1.46   0.145    -.3717728    .0224663
     medium  |  -.2954653   .1381362    -2.14   0.032    -.5226791   -.0682514
             |
       order |
          2  |  -.3452789   .2389209    -1.45   0.148    -.7382687     .047711
          3  |  -.9088799   .2018947    -4.50   0.000    -1.240967   -.5767927
------------------------------------------------------------------------------
cluster(Zip_Code)Zip_Codecluster(Zip_Code)Zip_Code

Bootstrap Corrected Estimates
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
Minority_w~1 |  -.1187963   .1420536    -0.84   0.418    -.3703637    .1327712
Minority_m~1 |  -.4281179   .1315351    -3.25   0.006    -.6610579    -.195178
------------------------------------------------------------------------------

. 
. mat def b=e(b)

. mat def V=e(V)

. 
. mat def R=J(2,3,.)

. 
. forvalues i= 1/2{
  2.         mat R[`i',1]=b[1,`i']
  3.         mat R[`i',2]=V[`i',`i']
  4.         mat R[`i',3]=e(df_`i')
  5.         }

. 
. matrix define B=J(2,5,.)

. 
. forvalues i= 1/2{
  2.         matrix B[`i',1] =  R[`i',1] - invttail(R[`i',3],0.05)*sqrt(R[`i',2
> ])
  3.         matrix B[`i',2] =  R[`i',1] 
  4.         matrix B[`i',3] =  R[`i',1] + invttail(R[`i',3],0.05)*sqrt(R[`i',2
> ])
  5. }

. 
.         
.         
. 
. 
.         sum Minority if within1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    Minority |      3,276    .6684982    .4708248          0          1

.         matrix B[1,4]=`r(N)'

. 
.         sum Minority if more1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    Minority |      3,505    .6664765     .471539          0          1

.         matrix B[2,4]=`r(N)'

.         
. 
.         sum choice if White==1 &  within1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      choice |      1,086    .3950276    .4890819          0          1

.         matrix B[1,5]=`r(mean)'

. 
.         sum choice if White==1 &  more1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      choice |      1,169    .3977759    .4896482          0          1

.         matrix B[2,5]=`r(mean)'

. mat list B      

B[2,5]
            c1          c2          c3          c4          c5
r1  -.37036369  -.11879626   .13277118        3276   .39502762
r2  -.66105786  -.42811791  -.19517796        3505   .39777588

. 
. 
. 
. 
. *****************************************************************************
> *******************
. * Matrix to dta
. *****************************************************************************
> *******************
. preserve

. clear

. svmat B
number of observations will be reset to 2
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 2

. gen n=_n

. replace B1=exp(B1)
(2 real changes made)

. replace B2=exp(B2)
(2 real changes made)

. replace B3=exp(B3)
(2 real changes made)

. 
. 
. 
. rename B1 lci

. rename B2 or

. rename B3 uci

. rename B4 obs

. rename B5 c_mean

. rename n distance

. 
. 
. save "../stores/aux/distance_minority_bootcl.dta"       , replace
file ../stores/aux/distance_minority_bootcl.dta saved

. restore

. 
. *****************************************************************************
> *******************
. * African American vs Hispanic/LatinX
. *****************************************************************************
> *******************
. * Within 1 more than 1
. *****************************************************************************
> *******************
. disc_boot choice  Hispanic_within1  Hispanic_more1  ///
>                                           Black_within1  Black_more1  ///
>                                           , varlist(i.gender i.education_leve
> l i.order)
note: multiple positive outcomes within groups encountered.
note: 1,331 groups (4,026 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood =  -921.4252  
Iteration 1:   log pseudolikelihood = -912.27329  
Iteration 2:   log pseudolikelihood = -912.22153  
Iteration 3:   log pseudolikelihood = -912.22153  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      2,755
                                                Wald chi2(9)      =     137.76
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -912.22153               Pseudo R2         =     0.0968

                              (Std. Err. adjusted for 14 clusters in Zip_Code)
------------------------------------------------------------------------------
             |               Robust
      choice |      Coef.   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
Hispanic_w~1 |    .145887   .0949978     1.54   0.125    -.0103705    .3021445
Hispanic_m~1 |  -.2055294   .0831921    -2.47   0.013    -.3423683   -.0686905
Black_with~1 |  -.3731296   .2101786    -1.78   0.076    -.7188425   -.0274166
 Black_more1 |   -.665722   .1555475    -4.28   0.000     -.921575   -.4098691
             |
      gender |
       male  |   -.324701   .0933971    -3.48   0.001    -.4783255   -.1710765
             |
education_~l |
        low  |  -.2161598   .1290243    -1.68   0.094    -.4283859   -.0039338
     medium  |   -.315826   .1315658    -2.40   0.016    -.5322325   -.0994195
             |
       order |
          2  |  -.3410449   .2475256    -1.38   0.168    -.7481883    .0660984
          3  |  -.9144952   .2111412    -4.33   0.000    -1.261792   -.5671988
------------------------------------------------------------------------------
cluster(Zip_Code)Zip_Codecluster(Zip_Code)Zip_Codecluster(Zip_Code)Zip_Codeclus
> ter(Zip_Code)Zip_Code

Bootstrap Corrected Estimates
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      t    P>|t|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
Hispanic_w~1 |    .145887   .1009841     1.44   0.172     -.032949    .3247231
Hispanic_m~1 |  -.2055294   .0921015    -2.23   0.044    -.3686351   -.0424238
Black_with~1 |  -.3731296   .2264805    -1.65   0.123    -.7742114    .0279522
 Black_more1 |   -.665722   .1810299    -3.68   0.003    -.9863139   -.3451301
------------------------------------------------------------------------------

. 
. mat def b=e(b)

. mat def V=e(V)

. 
. mat def R=J(4,3,.)

. 
. forvalues i= 1/4{
  2.         mat R[`i',1]=b[1,`i']
  3.         mat R[`i',2]=V[`i',`i']
  4.         mat R[`i',3]=e(df_`i')
  5.         }

. 
. 
. matrix define H=J(2,5,.)

. forvalues i= 1/2{
  2.         matrix H[`i',1] =  R[`i',1] - invttail(R[`i',3],0.05)*sqrt(R[`i',2
> ])
  3.         matrix H[`i',2] =  R[`i',1] 
  4.         matrix H[`i',3] =  R[`i',1] + invttail(R[`i',3],0.05)*sqrt(R[`i',2
> ])
  5. }

. 
.         sum Hispanic if within1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    Hispanic |      3,276    .3336386    .4715843          0          1

.         matrix H[1,4]=`r(N)'

. 
.         sum Hispanic if more1 ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    Hispanic |      3,505    .3326676    .4712359          0          1

.         matrix H[2,4]=`r(N)'

.         mat list H

H[2,5]
            c1          c2          c3          c4          c5
r1  -.03294904   .14588704   .32472313        3276           .
r2  -.36863507  -.20552944  -.04242381        3505           .

. 
.         sum choice if White==1 &  within1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      choice |      1,086    .3950276    .4890819          0          1

.         matrix H[1,5]=`r(mean)'

. 
.         sum choice if White==1 &  more1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      choice |      1,169    .3977759    .4896482          0          1

.         matrix H[2,5]=`r(mean)'

.         mat list H

H[2,5]
            c1          c2          c3          c4          c5
r1  -.03294904   .14588704   .32472313        3276   .39502762
r2  -.36863507  -.20552944  -.04242381        3505   .39777588

. 
. 
. matrix define B=J(2,5,.)

. 
. forvalues i= 1/2{
  2.         matrix B[`i',1] =  R[`i'+2,1] - invttail(R[`i'+2,3],0.05)*sqrt(R[`
> i'+2,2])
  3.         matrix B[`i',2] =  R[`i'+2,1] 
  4.         matrix B[`i',3] =  R[`i'+2,1] + invttail(R[`i'+2,3],0.05)*sqrt(R[`
> i'+2,2])
  5. }

. 
. 
.         sum Black if within1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       Black |      3,276    .3348596    .4720134          0          1

.         matrix B[1,4]=`r(N)'

. 
.         sum Black if more1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       Black |      3,505    .3338088    .4716397          0          1

.         matrix B[2,4]=`r(N)'

.         mat list B

B[2,5]
            c1          c2          c3          c4          c5
r1  -.77421138  -.37312958   .02795222        3276           .
r2  -.98631394  -.66572203  -.34513012        3505           .

. 
.         sum choice if White==1 &  within1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      choice |      1,086    .3950276    .4890819          0          1

.         matrix B[1,5]=`r(mean)'

. 
.         sum choice if White==1 &  more1==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      choice |      1,169    .3977759    .4896482          0          1

.         matrix B[2,5]=`r(mean)'

.         mat list B

B[2,5]
            c1          c2          c3          c4          c5
r1  -.77421138  -.37312958   .02795222        3276   .39502762
r2  -.98631394  -.66572203  -.34513012        3505   .39777588

. 
. 
. 
. 
. *****************************************************************************
> *******************
. * Matrix to dta
. *****************************************************************************
> *******************
. preserve

. clear

. svmat B
number of observations will be reset to 2
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 2

. gen n=_n

. replace B1=exp(B1)
(2 real changes made)

. replace B2=exp(B2)
(2 real changes made)

. replace B3=exp(B3)
(2 real changes made)

. 
. 
. 
. rename B1 lci

. rename B2 or

. rename B3 uci

. rename B4 obs

. rename B5 c_mean

. rename n distance

. 
. 
. 
. save "../stores/aux/distance_race_afam_bootcl.dta"      , replace
file ../stores/aux/distance_race_afam_bootcl.dta saved

. restore

. 
. preserve

. clear

. svmat H
number of observations will be reset to 2
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 2

. gen n=_n

. replace H1=exp(H1)
(2 real changes made)

. replace H2=exp(H2)
(2 real changes made)

. replace H3=exp(H3)
(2 real changes made)

. 
. 
. 
. rename H1 lci

. rename H2 or

. rename H3 uci

. rename H4 obs

. rename H5 c_mean

. rename n distance

. 
. 
. 
. save "../stores/aux/distance_race_hispanic_bootcl.dta"  , replace
file ../stores/aux/distance_race_hispanic_bootcl.dta saved

. restore

. 
. 
. clogit choice Hispanic_within1  Hispanic_more1  ///
>                                           Black_within1  Black_more1  ///
>                                           i.order i.gender  i.education_level
>  , group(Address) or  cl(Zip_Code) level(90)
note: multiple positive outcomes within groups encountered.
note: 1,331 groups (4,026 obs) dropped because of all positive or
      all negative outcomes.

Iteration 0:   log pseudolikelihood =  -921.4252  
Iteration 1:   log pseudolikelihood = -912.27329  
Iteration 2:   log pseudolikelihood = -912.22153  
Iteration 3:   log pseudolikelihood = -912.22153  

Conditional (fixed-effects) logistic regression

                                                Number of obs     =      2,755
                                                Wald chi2(9)      =     137.76
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -912.22153               Pseudo R2         =     0.0968

                              (Std. Err. adjusted for 14 clusters in Zip_Code)
------------------------------------------------------------------------------
             |               Robust
      choice | Odds Ratio   Std. Err.      z    P>|z|     [90% Conf. Interval]
-------------+----------------------------------------------------------------
Hispanic_w~1 |   1.157065   .1099187     1.54   0.125     .9896831    1.352757
Hispanic_m~1 |   .8142161   .0677364    -2.47   0.013     .7100866    .9336156
Black_with~1 |    .688576   .1447239    -1.78   0.076      .487316    .9729558
 Black_more1 |   .5139023   .0799362    -4.28   0.000     .3978919    .6637371
             |
       order |
          2  |    .711027   .1759974    -1.38   0.168     .4732231    1.068332
          3  |   .4007189   .0846083    -4.33   0.000     .2831463    .5671118
             |
      gender |
       male  |   .7227434   .0675021    -3.48   0.001     .6198204    .8427571
             |
education_~l |
        low  |   .8056065   .1039428    -1.68   0.094       .65156    .9960739
     medium  |   .7291863    .095936    -2.40   0.016     .5872924    .9053628
------------------------------------------------------------------------------

. 
. 
. 
. 
. 
. 
. 
. 
. 
. *end
. 
end of do-file
